JMeter-Tests/jmeter-test-plans/booking-100users.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Booking Creation Test - 100 Users" enabled="true">
      <stringProp name="TestPlan.comments">Booking Creation Test - 100 Users - 100 concurrent users</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
        <stringProp name="HTTPSampler.domain">af859bf4c90fe45a8a617d2337fe265b-73469934.us-west-2.elb.amazonaws.com</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Booking Creation Test - 100 Users" enabled="true">
        <intProp name="ThreadGroup.num_threads">100</intProp>
        <intProp name="ThreadGroup.ramp_time">30</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="startDay" elementType="Argument">
              <stringProp name="Argument.name">startDay</stringProp>
              <stringProp name="Argument.value">${__jexl3(1 + ((${__threadNum} - 1) * 5) % 30,)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="endDay" elementType="Argument">
              <stringProp name="Argument.name">endDay</stringProp>
              <stringProp name="Argument.value">${__jexl3(startDay + 4,)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="guests" elementType="Argument">
              <stringProp name="Argument.name">guests</stringProp>
              <stringProp name="Argument.value">${__jexl3(((${__threadNum} % 4) + 1),)}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="threadNum" elementType="Argument">
              <stringProp name="Argument.name">threadNum</stringProp>
              <stringProp name="Argument.value">${__threadNum}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login for Booking" enabled="true">
          <stringProp name="HTTPSampler.path">/api/traveler/auth/login</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  &quot;email&quot;: &quot;traveler${__threadNum}@test.com&quot;,
  &quot;password&quot;: &quot;testpassword123&quot;,
  &quot;userType&quot;: &quot;traveler&quot;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract token" enabled="true">
            <stringProp name="JSONPostProcessor.referenceName">token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExpr">$.token</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Token (Backup)" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">token_backup</stringProp>
            <stringProp name="RegexExtractor.regex">&quot;token&quot;\s*:\s*&quot;([^&quot;]+)&quot;</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
            <boolProp name="RegexExtractor.default_empty_value">false</boolProp>
          </RegexExtractor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get Properties for Booking" enabled="true">
          <stringProp name="HTTPSampler.path">/api/property/properties</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Extract Property ID" enabled="true">
            <stringProp name="JSONPostProcessor.referenceName">propertyId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExpr">$.properties[0].id</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
            <stringProp name="JSONPostProcessor.defaultValues">691e1bdec5154918afb283d9</stringProp>
            <stringProp name="JSONPostProcessor.referenceNames">propertyId</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.properties[0].id</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract Property ID (Backup)" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">propertyId_backup</stringProp>
            <stringProp name="RegexExtractor.regex">&quot;id&quot;\s*:\s*&quot;([^&quot;]+)&quot;</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
            <boolProp name="RegexExtractor.default_empty_value">true</boolProp>
          </RegexExtractor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create Booking" enabled="true">
          <stringProp name="HTTPSampler.path">/api/booking/bookings</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{
  &quot;propertyId&quot;: &quot;${propertyId}&quot;,
  &quot;startDate&quot;: &quot;${startDateFinal}&quot;,
  &quot;endDate&quot;: &quot;${endDateFinal}&quot;,
  &quot;guests&quot;: ${guests}
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Build Date Strings" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">// Get thread number
def threadNum = ctx.getThreadNum()

// Simple: Each user books 1 night starting from 2026-01-01
// Thread 1: Jan 1-2, Thread 2: Jan 2-3, Thread 3: Jan 3-4, etc.

def year = 2026
def month = 1  // Start in January
def startDayInt = threadNum  // Day 1, 2, 3, etc.

// Days per month (2026 is NOT a leap year)
def daysInMonth = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]

// Calculate which month and day based on thread number
def dayCounter = threadNum
def currentMonth = 0  // 0-indexed (0 = January)

while (dayCounter &gt; daysInMonth[currentMonth]) {
  dayCounter -= daysInMonth[currentMonth]
  currentMonth++
  if (currentMonth &gt;= 12) {
    // Move to next year (shouldn&apos;t happen with 100 threads, but handle it)
    year++
    currentMonth = 0
  }
}

month = currentMonth + 1  // Convert to 1-indexed
startDayInt = dayCounter

// End day is start day + 1 (1 night booking)
def endDayInt = startDayInt + 1
def endMonth = month
def endYear = year

// Check if end day exceeds current month
if (endDayInt &gt; daysInMonth[currentMonth]) {
  // Move to next month
  endDayInt = 1
  endMonth = month + 1
  if (endMonth &gt; 12) {
    endMonth = 1
    endYear = year + 1
  }
}

// Format with zero-padding
def startDayStr = String.format(&quot;%02d&quot;, startDayInt)
def endDayStr = String.format(&quot;%02d&quot;, endDayInt)
def monthStr = String.format(&quot;%02d&quot;, month)
def endMonthStr = String.format(&quot;%02d&quot;, endMonth)

// Create final date strings
vars.put(&quot;startDateFinal&quot;, year + &quot;-&quot; + monthStr + &quot;-&quot; + startDayStr)
vars.put(&quot;endDateFinal&quot;, endYear + &quot;-&quot; + endMonthStr + &quot;-&quot; + endDayStr)</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${token_backup}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>